Tekla.Structures.Plugins.CustomPartInputTypeAttribute
The CustomPartInputTypeAttribute class is used for identifying that the connection is a seam and defining the input type.
Based on the type the system will then ask for the correct number of input points in the creation.
The attribute is initialized from the custom attribute
[CustomPartInputType(CustomPartBase.CustomPartInputType.INPUT_MAX_10_POINTS)]
in the connection source.
Not yet supported fully in core yet.

Tekla.Structures.Plugins.CustomPartInputTypeAttribute.#ctor(System.Int32)
The custom attribute uses this to store the input type to the system.
This is not to be used by itself.
Type: The seam input type.